# 데이터프레임의 결합
- 유니언 결합
    - 단순하게 행을 결합하거나 열을 결합
- 조인결합
    - 특정한 조건에 맞춰서 데이터의 열을 추가하는 결합 방식
    - 데이터프레임+데이터프레임 -> 특정 컬럼의 데이터들이 같은 값들로 이루어져있을때 열을 추가

In [2]:
import pandas as pd

C:\Users\82105\AppData\Local\Temp\ipykernel_143696\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
data={
    'name':['test','test2','test3'],
    'age':[20,30,40]
}
df1=pd.DataFrame(data)

In [5]:
data={
    'name':['test4','test5'],
    'loc':['seoul','busan']
}
df2=pd.DataFrame(data)

In [7]:
# 2개의 데이터프레임을 단순한 결합
# concat( {데이터프레임명 1차원 리스트의 형태} , axis={0|1}, ignore_index={bool} )
# axis 행으로 결합을 할지 열으로 결합을할지 지정
# ignore_index 기본값은 False, True로 변경하면 인덱스나 컬럼이 초기화
# concat 함수는 pandas에 내장된 함수
pd.concat(
    [df1, df2],
    axis=1,
    ignore_index=True
)

       0   1      2      3
0   test  20  test4  seoul
1  test2  30  test5  busan
2  test3  40    NaN    NaN

In [8]:
data={
    "name":['test6','test7'],
    "age":[25,35],
    "loc":['ulsan','mokpo']
}
df3=pd.DataFrame(data)

In [9]:
pd.concat(
    [df1,df2,df3],
    axis=0

)

    name   age    loc
0   test  20.0    NaN
1  test2  30.0    NaN
2  test3  40.0    NaN
0  test4   NaN  seoul
1  test5   NaN  busan
0  test6  25.0  ulsan
1  test7  35.0  mokpo

In [11]:
# 조인결합
# merge( {데이터프레임명1},{데이터프레임명2},
# on={조건식}, how={left|right|inner|outer})
# on 매개변수 : 2개의 데이터프레임에 컬럼의 이름이 같은 경우
# left_on, right_on 매개변수 : 2개의 데이터프레임에 조건 컬럼의 이름이 다른 경우

data={
    'id':['test','test2','test3','test4'],
    'item':['A','A','B','D']
}

df1=pd.DataFrame(data)

In [12]:
data={
    'item':['A','B','C'],
    'price':[100,200,300]
}

df2=pd.DataFrame(data)

In [13]:
# 조인 결합
pd.merge(
    df1, df2, on='item',how='left'
)

      id item  price
0   test    A  100.0
1  test2    A  100.0
2  test3    B  200.0
3  test4    D    NaN

In [14]:
pd.merge(
    df1,df2,on='item',how='right'
)

      id item  price
0   test    A    100
1  test2    A    100
2  test3    B    200
3    NaN    C    300

In [15]:
pd.merge(
    df1,df2,on='item',how='inner'
)

      id item  price
0   test    A    100
1  test2    A    100
2  test3    B    200

In [21]:
pd.merge(df1,df2,left_on='item',right_on='item_name', how='outer')

      id item item_name  price
0   test    A         A  100.0
1  test2    A         A  100.0
2  test3    B         B  200.0
3    NaN  NaN         C  300.0
4  test4    D       NaN    NaN

In [17]:
df2.columns=["item_name","price"]

In [19]:
df2

  item_name  price
0         A    100
1         B    200
2         C    300

# 데이터프레임의 결합 문제
1. csv 폴더에서 tran_1, tran_2, tran_d_1, tran_d_2 파일을 각각 로드
2. tran_1, tran_2 데이터프레임은 단순한 행 결합
3. tran_d_1, tran_d_2 데이터프레임은 단순한 행 결합
4. 2번 과정과 3번과정에서 나온 데이터 프레임을 조건에 맞게 조인결합

In [25]:
tr1=pd.read_csv("../../csv/tran_1.csv")
tr2=pd.read_csv("../../csv/tran_2.csv")
trd1=pd.read_csv("../../csv/tran_d_1.csv")
trd2=pd.read_csv("../../csv/tran_d_2.csv")

In [28]:
tran=pd.concat(
    [tr1, tr2],
    axis=0,
    ignore_index=True
)

In [29]:
tran_d=pd.concat(
    [trd1, trd2],
    axis=0,
    ignore_index=True
)

In [30]:
tran.head(1)

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502

In [31]:
tran_d.head(1)

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1

In [32]:
tran.isna().sum()

transaction_id    0
price             0
payment_date      0
customer_id       0
dtype: int64

In [33]:
tran_d.isna().sum()

detail_id         0
transaction_id    0
item_id           0
quantity          0
dtype: int64

In [34]:
len(tran['transaction_id'].unique())

6786

In [35]:
len(tran_d['transaction_id'].unique())

6786

In [36]:
pd.merge(tran,tran_d, on='transaction_id', how='inner')

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2
...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1

# 특정 경로에 있는 파일의 목록을 로드
- 어느 경로의 파일의 목록을 가지고 오는가? (경로)
- 특정 확장자 파일들을 로드

In [37]:
import os

In [38]:
os.listdir("../../csv/2017")

['201701_expense_list.csv',
 '201702_expense_list.csv',
 '201703_expense_list.csv',
 '201704_expense_list.csv',
 '201705_expense_list.csv',
 '201706_expense_list.csv',
 '201707_expense_list.csv',
 '201708_expense_list.csv',
 '201709_expense_list.csv',
 '201710_expense_list.csv',
 '201711_expense_list.csv',
 '201712_expense_list.csv']

In [39]:
file_path="../../csv/2017/"
file_list=os.listdir(file_path)
file_list

['201701_expense_list.csv',
 '201702_expense_list.csv',
 '201703_expense_list.csv',
 '201704_expense_list.csv',
 '201705_expense_list.csv',
 '201706_expense_list.csv',
 '201707_expense_list.csv',
 '201708_expense_list.csv',
 '201709_expense_list.csv',
 '201710_expense_list.csv',
 '201711_expense_list.csv',
 '201712_expense_list.csv']

In [40]:
# 비어있는 데이터 프레임을 생성
df2017=pd.DataFrame()
df2017

Empty DataFrame
Columns: []
Index: []

In [44]:
for file in file_list:
    # file이 의미하는 것은? -> file_name
    # print(file)
    df=pd.read_csv(file_path+file)
    df2017=pd.concat(
        [df2017, df],axis=0
    )

In [45]:
df2017.info()

<class 'pandas.core.frame.DataFrame'>
Index: 70132 entries, 0 to 7285
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   nid                70132 non-null  int64
 1   title              70132 non-null  object
 2   url                70132 non-null  object
 3   dept_nm_lvl_1      70132 non-null  object
 4   dept_nm_lvl_2      70074 non-null  object
 5   dept_nm_lvl_3      61262 non-null  object
 6   dept_nm_lvl_4      17939 non-null  object
 7   dept_nm_lvl_5      3474 non-null   object
 8   exec_yr            70132 non-null  int64
 9   exec_month         70132 non-null  int64
 10  expense_budget     3108 non-null   float64
 11  expense_execution  2805 non-null   float64
 12  category           1259 non-null   object
 13  dept_nm_full       70053 non-null  object
 14  exec_dt            70132 non-null  object
 15  exec_loc           69360 non-null  object
 16  exec_purpose       70110 non-null  object
 17  target_nm          69597 non-null  object
 18  payment_method     69929 non-null  object
 19  exec_amount        70132 non-null  int64
dtypes: float64(2), int64(4), object(14)
memory usage: 11.2+ MB

In [49]:
def data_load(_path,_end='csv'):

    # 혹시나 _path 값에 마지막이 '/'가 아닌경우
    _path=_path+'/'

    # 비어있는 데이터프레임을 생성
    result=pd.DataFrame()

    # 파일 목록 로드
    file_list=os.listdir(_path)

    # file_list를 기준으로 반복문 생성
    for file in file_list:
        if file.endswith(_end):
            # _end에 따라서 read 함수가 변경
            if _end == 'csv':
                df=pd.read_csv(_path+file)
            elif _end =='json':
                df=pd.read_json(_path+file)
            elif _end == 'xml':
                df=pd.read_xml(_path+file)
            elif _end in['xls','xlsx']:
                df=pd.read_excel(_path+file)
            else:
                return "지원하지 않는 확장자입니다."
            print(file, len(df))
            result=pd.concat(
                [result,df],axis=0
            )
    return result

In [52]:
df2019=data_load('../../csv/2019', 'json')

201901_expense_list.json 6392
201902_expense_list.json 5562
201903_expense_list.json 6115
201904_expense_list.json 6351
201905_expense_list.json 5827
201906_expense_list.json 5599
201907_expense_list.json 6450
201908_expense_list.json 5572
201909_expense_list.json 5595
201910_expense_list.json 6429
201911_expense_list.json 6471
201912_expense_list.json 7844

In [53]:
df2021=data_load('../../csv/2021', 'csv')

202101_expense_list.csv 4878
202102_expense_list.csv 5325
202103_expense_list.csv 6903
202104_expense_list.csv 6189
202105_expense_list.csv 6197
202106_expense_list.csv 7511
202107_expense_list.csv 6382
202108_expense_list.csv 6330
202109_expense_list.csv 6842
202110_expense_list.csv 7617
202111_expense_list.csv 9301
202112_expense_list.csv 10344